
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_PORT
* Replace
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_HOST


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      ~ id                      = "https://darts-stg.vault.azure.net/secrets/darts-api-POSTGRES-PASS/67ea59c889734a65a0321b0158d2ea7a" -> (known after apply)
      ~ name                    = "darts-api-POSTGRES-PASS" -> "api-POSTGRES-PASS" # forces replacement
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg/secrets/darts-api-POSTGRES-PASS/versions/67ea59c889734a65a0321b0158d2ea7a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg/secrets/darts-api-POSTGRES-PASS" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "67ea59c889734a65a0321b0158d2ea7a" -> (known after apply)
      ~ versionless_id          = "https://darts-stg.vault.azure.net/secrets/darts-api-POSTGRES-PASS" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      ~ id                      = "https://darts-stg.vault.azure.net/secrets/darts-api-POSTGRES-USER/355e8c7467fd42e5b382adcab24b7f3e" -> (known after apply)
      ~ name                    = "darts-api-POSTGRES-USER" -> "api-POSTGRES-USER" # forces replacement
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg/secrets/darts-api-POSTGRES-USER/versions/355e8c7467fd42e5b382adcab24b7f3e" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg/secrets/darts-api-POSTGRES-USER" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "355e8c7467fd42e5b382adcab24b7f3e" -> (known after apply)
      ~ versionless_id          = "https://darts-stg.vault.azure.net/secrets/darts-api-POSTGRES-USER" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg"
      + name                    = "api-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      ~ id                      = "https://darts-stg.vault.azure.net/secrets/darts-api-POSTGRES-HOST/94ff28e2d76642858b2b477b1b43767f" -> (known after apply)
      ~ name                    = "darts-api-POSTGRES-HOST" -> "api-POSTGRES-HOST" # forces replacement
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg/secrets/darts-api-POSTGRES-HOST/versions/94ff28e2d76642858b2b477b1b43767f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg/secrets/darts-api-POSTGRES-HOST" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "94ff28e2d76642858b2b477b1b43767f" -> (known after apply)
      ~ versionless_id          = "https://darts-stg.vault.azure.net/secrets/darts-api-POSTGRES-HOST" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg"
      + name                    = "api-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 5 to add, 0 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":99,"Program":"tfcmt","SHA1":"","Vars":{}} -->